In [4]:

%matplotlib widget

### 累計レポート
# 標準ライブラリ
import os
from datetime import datetime, timedelta
from typing import List, Dict, Tuple, Optional, Callable

# サードパーティライブラリ
import pandas as pd
from pandas import Timedelta
import matplotlib.pyplot as plt
from matplotlib.ticker import ScalarFormatter
from IPython.display import Markdown, display

# プロジェクト内モジュール
from gamedata import hard_sales as hs
from gamedata import plot_hard as ph
from gamedata import hard_info as hi
from gamedata import hard_event as he
from gamedata import chart_hard as ch

plt.show()

df_all = hs.load_hard_sales()

In [5]:
def chart_reached_unit(n:int) -> pd.DataFrame:
    df = hs.load_hard_sales()
    d2 = hs.extract_week_reached_units(df, n).sort_values('delta_week', ascending=True).head(10)
    d3 = d2[['report_date', 'hw', 'delta_week', 'sum_units']].copy()
    d3 = d3.copy().assign(delta_week=lambda x: x['delta_week'] + 1)
    d3.reset_index(drop=True, inplace=True)
    d3.index += 1
    return d3

# 普及速度ダッシュボード

### XX週目の値比較

In [6]:

ch.chart_delta_week(27)

   report_date  delta_week       hw             full_name  sum_units
1   2025-12-14          27      NS2      Nintendo Switch2    3362777
2   2001-09-30          27      GBA      GAME BOY ADVANCE    3232067
3   2000-09-10          27      PS2          PlayStation2    2694168
4   2007-06-10          27      Wii                   Wii    2627410
5   2005-06-12          27       DS           Nintendo DS    2263507
6   2011-09-04          27      3DS          Nintendo 3DS    1738278
7   2017-09-10          27      NSW       Nintendo Switch    1645931
8   2005-06-19          27      PSP  PlayStation Portable    1455644
9   2002-03-24          27       GC     Nintendo GAMECUBE    1267859
10  1999-08-01          27      PKS         PocketStation    1244040
11  2013-06-16          27     WiiU                  WiiU     945611
12  2007-05-20          27      PS3          PlayStation3     918658
13  2012-06-24          27     Vita      PlayStation Vita     756451
14  2021-05-23          27      PS5          PlayStation5     742726
15  2014-08-31          27      PS4          PlayStation4     666418
16  1999-06-06          27       DC             DreamCast     647214
17  1999-09-12          27       WS            WonderSwan     553349
18  2002-09-01          27     Xbox                  Xbox     268130
19  2006-06-18          27    XB360               Xbox360     144847
20  1999-05-09          27  NeoGeoP         NeoGeo Pocket     102111
21  2015-03-15          27    XBOne               XboxOne      50644
22  2021-05-23          27      XSX       Xbox Series X|S      44956

## 100万台

In [7]:
chart_reached_unit(1_000_000)

   report_date   hw  delta_week  sum_units
1   2001-04-08  GBA           3    1132611
2   2025-06-22  NS2           3    1008663
3   2004-12-26   DS           4    1056428
4   2000-04-02  PS2           5    1134882
5   2007-01-07  Wii           6    1135671
6   2011-05-22  3DS          13    1008237
7   2005-03-13  PSP          14    1002827
8   2017-06-25  NSW          17    1016473
9   2002-01-06   GC          17    1064457
10  1999-07-18  PKS          26    1044582

## 200万台

In [8]:
chart_reached_unit(2_000_000)

   report_date   hw  delta_week  sum_units
1   2001-06-17  GBA          13    2043244
2   2025-09-14  NS2          15    2024761
3   2000-06-25  PS2          17    2008755
4   2007-04-08  Wii          19    2038951
5   2005-05-01   DS          22    2037178
6   2011-10-09  3DS          33    2024869
7   2017-10-29  NSW          35    2041221
8   1999-10-10  PKS          38    2051852
9   2005-11-06  PSP          48    2003979
10  2003-01-05   GC          69    2032355

## 300万台

In [9]:
chart_reached_unit(3_000_000)

   report_date   hw  delta_week  sum_units
1   2001-09-09  GBA          25    3051291
2   2025-12-07  NS2          27    3171833
3   2007-07-15  Wii          33    3014828
4   2011-12-11  3DS          42    3233571
5   2005-09-18   DS          42    3015412
6   2000-12-17  PS2          42    3005742
7   2017-12-24  NSW          43    3291903
8   2000-01-23  PKS          53    3011335
9   2006-02-26  PSP          64    3021494
10  2004-01-04   GC         121    3115532

In [10]:
chart_reached_unit(3_170_000)

   report_date   hw  delta_week  sum_units
1   2001-09-23  GBA          27    3170501
2   2025-12-07  NS2          27    3171833
3   2007-08-05  Wii          36    3223673
4   2011-12-11  3DS          42    3233571
5   2017-12-24  NSW          43    3291903
6   2001-01-07  PS2          45    3179829
7   2005-10-16   DS          46    3216812
8   2000-03-12  PKS          60    3180904
9   2006-03-26  PSP          68    3174196
10  2004-01-25   GC         124    3180437

## 400万台

In [11]:
chart_reached_unit(4_000_000)

   report_date   hw  delta_week  sum_units
1   2001-12-30  GBA          41    4245686
2   2011-12-25  3DS          44    4132038
3   2005-12-11   DS          54    4102277
4   2007-12-09  Wii          54    4025012
5   2018-03-25  NSW          56    4037144
6   2001-06-03  PS2          66    4019182
7   2006-09-24  PSP          94    4006979
8   2023-07-30  PS5         142    4046566
9   2017-01-08  PS4         151    4089279
10  2009-12-13  PS3         162    4020563

## 500万台

## 600万台

## 700万台

## 1000万台

In [12]:
chart_reached_unit(10_000_000)

  report_date   hw  delta_week  sum_units
1  2006-08-13   DS          89   10103791
2  2013-01-06  3DS          98   10064491
3  2003-08-10  GBA         125   10053173
4  2019-11-17  NSW         142   10065815
5  2002-12-29  PS2         148   10099415
6  2010-02-28  Wii         170   10009736
7  2008-08-24  PSP         194   10005546
8  2015-04-12  PS3         440   10000545

In [13]:
chart_reached_unit(20_000_000)

  report_date   hw  delta_week  sum_units
1  2007-11-25   DS         156   20051787
2  2021-05-30  NSW         222   20018296
3  2016-01-17  3DS         256   20029293
4  2007-08-05  PS2         388   20010665

In [14]:
chart_reached_unit(30_000_000)

  report_date   hw  delta_week  sum_units
1  2010-03-21   DS         277   30030199
2  2023-07-30  NSW         335   30073527

In [15]:
chart_reached_unit(35_000_000)

  report_date   hw  delta_week  sum_units
1  2025-01-05  NSW         410   35005506